; domain
(define (domain driverlog)
  (:requirements :typing :fluents) 
  (:types           location locatable - object
		driver truck obj - locatable)

  (:predicates 
		(at ?obj - locatable ?loc - location)
		(in ?obj1 - obj ?obj - truck)
		(driving ?d - driver ?v - truck)
		(link ?x ?y - location) (path ?x ?y - location)
		(empty ?v - truck)
)
  (:functions 	(time-to-walk ?l1 ?l2 - location)
		(time-to-drive ?l1 ?l2 - location)
		(fuel-used)
		(fuel-per-minute ?t - truck)
		(load ?t - truck)
  )


(:action LOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck) (increase (load ?truck) 1)
		(increase (fuel-per-minute ?truck) (+ (load ?truck) 1))))

(:action UNLOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc) (decrease (load ?truck) 1)
		(decrease (fuel-per-minute ?truck) (load ?truck))))


(:action BOARD-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
  :effect
   (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))

(:action DISEMBARK-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (driving ?driver ?truck))
  :effect
   (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))

(:action DRIVE-TRUCK
  :parameters
   (?truck - truck
    ?loc-from - location
    ?loc-to - location
    ?driver - driver)
  :precondition
   (and (at ?truck ?loc-from)
   (driving ?driver ?truck) (link ?loc-from ?loc-to))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)
		(increase (fuel-used) (* (fuel-per-minute ?truck) (time-to-drive ?loc-from ?loc-to)))))

(:action WALK
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location)
  :precondition
   (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
  :effect
   (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))

 
)

; problem
(define (problem DLOG-4-2-7-151)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	driver4 - driver
	truck1 - truck
	truck2 - truck
	package1 - obj
	package2 - obj
	package3 - obj
	package4 - obj
	package5 - obj
	package6 - obj
	package7 - obj
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	s5 - location
	p5-3 - location
	p4-5 - location
	p3-1 - location
	p3-2 - location
	p1-4 - location
	p2-1 - location
	p0-2 - location
	)
	(:init
	(at driver1 s2)
	(at driver2 s4)
	(at driver3 s4)
	(at driver4 s2)
	(at truck1 s5)
	(empty truck1)
	(= (load truck1) 0)
	(= (fuel-per-minute truck1) 10)
	(at truck2 s2)
	(empty truck2)
	(= (load truck2) 0)
	(= (fuel-per-minute truck2) 10)
	(at package1 s2)
	(at package2 s4)
	(at package3 s5)
	(at package4 s0)
	(at package5 s4)
	(at package6 s1)
	(at package7 s0)
	(path s5 p5-3)
	(path p5-3 s5)
	(path s3 p5-3)
	(path p5-3 s3)
	(= (time-to-walk s5 p5-3) 25)
	(= (time-to-walk p5-3 s5) 25)
	(= (time-to-walk s3 p5-3) 29)
	(= (time-to-walk p5-3 s3) 29)
	(path s4 p4-5)
	(path p4-5 s4)
	(path s5 p4-5)
	(path p4-5 s5)
	(= (time-to-walk s4 p4-5) 12)
	(= (time-to-walk p4-5 s4) 12)
	(= (time-to-walk s5 p4-5) 16)
	(= (time-to-walk p4-5 s5) 16)
	(path s3 p3-1)
	(path p3-1 s3)
	(path s1 p3-1)
	(path p3-1 s1)
	(= (time-to-walk s3 p3-1) 32)
	(= (time-to-walk p3-1 s3) 32)
	(= (time-to-walk s1 p3-1) 43)
	(= (time-to-walk p3-1 s1) 43)
	(path s3 p3-2)
	(path p3-2 s3)
	(path s2 p3-2)
	(path p3-2 s2)
	(= (time-to-walk s3 p3-2) 16)
	(= (time-to-walk p3-2 s3) 16)
	(= (time-to-walk s2 p3-2) 9)
	(= (time-to-walk p3-2 s2) 9)
	(path s1 p1-4)
	(path p1-4 s1)
	(path s4 p1-4)
	(path p1-4 s4)
	(= (time-to-walk s1 p1-4) 7)
	(= (time-to-walk p1-4 s1) 7)
	(= (time-to-walk s4 p1-4) 45)
	(= (time-to-walk p1-4 s4) 45)
	(path s2 p2-1)
	(path p2-1 s2)
	(path s1 p2-1)
	(path p2-1 s1)
	(= (time-to-walk s2 p2-1) 12)
	(= (time-to-walk p2-1 s2) 12)
	(= (time-to-walk s1 p2-1) 36)
	(= (time-to-walk p2-1 s1) 36)
	(path s0 p0-2)
	(path p0-2 s0)
	(path s2 p0-2)
	(path p0-2 s2)
	(= (time-to-walk s0 p0-2) 43)
	(= (time-to-walk p0-2 s0) 43)
	(= (time-to-walk s2 p0-2) 39)
	(= (time-to-walk p0-2 s2) 39)
	(link s5 s2)
	(link s2 s5)
	(= (time-to-drive s5 s2) 41)
	(= (time-to-drive s2 s5) 41)
	(link s5 s3)
	(link s3 s5)
	(= (time-to-drive s5 s3) 20)
	(= (time-to-drive s3 s5) 20)
	(link s5 s4)
	(link s4 s5)
	(= (time-to-drive s5 s4) 12)
	(= (time-to-drive s4 s5) 12)
	(link s1 s2)
	(link s2 s1)
	(= (time-to-drive s1 s2) 38)
	(= (time-to-drive s2 s1) 38)
	(link s1 s5)
	(link s5 s1)
	(= (time-to-drive s1 s5) 45)
	(= (time-to-drive s5 s1) 45)
	(link s2 s3)
	(link s3 s2)
	(= (time-to-drive s2 s3) 21)
	(= (time-to-drive s3 s2) 21)
	(link s2 s4)
	(link s4 s2)
	(= (time-to-drive s2 s4) 41)
	(= (time-to-drive s4 s2) 41)
	(link s4 s0)
	(link s0 s4)
	(= (time-to-drive s4 s0) 3)
	(= (time-to-drive s0 s4) 3)
	(link s4 s1)
	(link s1 s4)
	(= (time-to-drive s4 s1) 42)
	(= (time-to-drive s1 s4) 42)
	(link s4 s3)
	(link s3 s4)
	(= (time-to-drive s4 s3) 4)
	(= (time-to-drive s3 s4) 4)
	(link s0 s1)
	(link s1 s0)
	(= (time-to-drive s0 s1) 11)
	(= (time-to-drive s1 s0) 11)
	(link s0 s3)
	(link s3 s0)
	(= (time-to-drive s0 s3) 19)
	(= (time-to-drive s3 s0) 19)
	(link s0 s5)
	(link s5 s0)
	(= (time-to-drive s0 s5) 15)
	(= (time-to-drive s5 s0) 15)
	(= (fuel-used) 0)
)
	(:goal (and
	(at driver3 s3)
	(at driver4 s0)
	(at truck1 s5)
	(at truck2 s1)
	(at package1 s1)
	(at package2 s1)
	(at package3 s4)
	(at package4 s2)
	(at package5 s1)
	(at package6 s3)
	(at package7 s3)
	))

(:metric minimize (+ (* 4 (total-time)) (* 2 (fuel-used))))

)

; plan
1. (board-truck driver1 truck2 s2)
   deleted: (at driver1 s2) (empty truck2)
   added: (driving driver1 truck2)
   goals met: 1 of 11
2. (walk driver4 s2 p0-2)
   deleted: (at driver4 s2)
   added: (at driver4 p0-2)
   goals met: 1 of 11
3. (walk driver4 p0-2 s0)
   deleted: (at driver4 p0-2)
   added: (at driver4 s0)
   goals met: 2 of 11
4. (load-truck package1 truck2 s2)
   deleted: (at package1 s2)
   added: (in package1 truck2)
   changed: (load truck2) from 0 to 1, (fuel-per-minute truck2) from 10 to 11
   goals met: 2 of 11
5. (drive-truck truck2 s2 s1 driver1)
   deleted: (at truck2 s2)
   added: (at truck2 s1)
   changed: (fuel-used) from 0 to 418
   goals met: 3 of 11
6. (unload-truck package1 truck2 s1)
   deleted: (in package1 truck2)
   added: (at package1 s1)
   changed: (load truck2) from 1 to 0, (fuel-per-minute truck2) from 11 to 10
   goals met: 4 of 11
7. (load-truck package6 truck2 s1)
   deleted: (at package6 s1)
   added: (in package6 truck2)
   changed: (load truck2) from 0 to 1, (fuel-per-minute truck2) from 10 to 11
   goals met: 4 of 11
8. (drive-truck truck2 s1 s4 driver1)
   deleted: (at truck2 s1)
   added: (at truck2 s4)
   changed: (fuel-used) from 418 to 880
   goals met: 3 of 11
9. (load-truck package2 truck2 s4)
   deleted: (at package2 s4)
   added: (in package2 truck2)
   changed: (load truck2) from 1 to 2, (fuel-per-minute truck2) from 11 to 13
   goals met: 3 of 11
10. (load-truck package5 truck2 s4)
   deleted: (at package5 s4)
   added: (in package5 truck2)
   changed: (load truck2) from 2 to 3, (fuel-per-minute truck2) from 13 to 16
   goals met: 3 of 11
11. (drive-truck truck2 s4 s1 driver1)
   deleted: (at truck2 s4)
   added: (at truck2 s1)
   changed: (fuel-used) from 880 to 1552
   goals met: 4 of 11
12. (unload-truck package2 truck2 s1)
   deleted: (in package2 truck2)
   added: (at package2 s1)
   changed: (load truck2) from 3 to 2, (fuel-per-minute truck2) from 16 to 13
   goals met: 5 of 11
13. (unload-truck package5 truck2 s1)
   deleted: (in package5 truck2)
   added: (at package5 s1)
   changed: (load truck2) from 2 to 1, (fuel-per-minute truck2) from 13 to 11
   goals met: 6 of 11
14. (drive-truck truck2 s1 s5 driver1)
   deleted: (at truck2 s1)
   added: (at truck2 s5)
   changed: (fuel-used) from 1552 to 2047
   goals met: 5 of 11
15. (load-truck package3 truck2 s5)
   deleted: (at package3 s5)
   added: (in package3 truck2)
   changed: (load truck2) from 1 to 2, (fuel-per-minute truck2) from 11 to 13
   goals met: 5 of 11
16. (drive-truck truck2 s5 s4 driver1)
   deleted: (at truck2 s5)
   added: (at truck2 s4)
   changed: (fuel-used) from 2047 to 2203
   goals met: 5 of 11
17. (unload-truck package3 truck2 s4)
   deleted: (in package3 truck2)
   added: (at package3 s4)
   changed: (load truck2) from 2 to 1, (fuel-per-minute truck2) from 13 to 11
   goals met: 6 of 11
18. (drive-truck truck2 s4 s3 driver1)
   deleted: (at truck2 s4)
   added: (at truck2 s3)
   changed: (fuel-used) from 2203 to 2247
   goals met: 6 of 11
19. (unload-truck package6 truck2 s3)
   deleted: (in package6 truck2)
   added: (at package6 s3)
   changed: (load truck2) from 1 to 0, (fuel-per-minute truck2) from 11 to 10
   goals met: 7 of 11
20. (drive-truck truck2 s3 s4 driver1)
   deleted: (at truck2 s3)
   added: (at truck2 s4)
   changed: (fuel-used) from 2247 to 2287
   goals met: 7 of 11
21. (disembark-truck driver1 truck2 s4)
   deleted: (driving driver1 truck2)
   added: (at driver1 s4) (empty truck2)
   goals met: 7 of 11
22. (board-truck driver3 truck2 s4)
   deleted: (at driver3 s4) (empty truck2)
   added: (driving driver3 truck2)
   goals met: 7 of 11
23. (drive-truck truck2 s4 s0 driver3)
   deleted: (at truck2 s4)
   added: (at truck2 s0)
   changed: (fuel-used) from 2287 to 2317
   goals met: 7 of 11
24. (load-truck package4 truck2 s0)
   deleted: (at package4 s0)
   added: (in package4 truck2)
   changed: (load truck2) from 0 to 1, (fuel-per-minute truck2) from 10 to 11
   goals met: 7 of 11
25. (load-truck package7 truck2 s0)
   deleted: (at package7 s0)
   added: (in package7 truck2)
   changed: (load truck2) from 1 to 2, (fuel-per-minute truck2) from 11 to 13
   goals met: 7 of 11
26. (drive-truck truck2 s0 s3 driver3)
   deleted: (at truck2 s0)
   added: (at truck2 s3)
   changed: (fuel-used) from 2317 to 2564
   goals met: 7 of 11
27. (drive-truck truck2 s3 s2 driver3)
   deleted: (at truck2 s3)
   added: (at truck2 s2)
   changed: (fuel-used) from 2564 to 2837
   goals met: 7 of 11
28. (unload-truck package4 truck2 s2)
   deleted: (in package4 truck2)
   added: (at package4 s2)
   changed: (load truck2) from 2 to 1, (fuel-per-minute truck2) from 13 to 11
   goals met: 8 of 11
29. (drive-truck truck2 s2 s1 driver3)
   deleted: (at truck2 s2)
   added: (at truck2 s1)
   changed: (fuel-used) from 2837 to 3255
   goals met: 9 of 11
30. (disembark-truck driver3 truck2 s1)
   deleted: (driving driver3 truck2)
   added: (at driver3 s1) (empty truck2)
   goals met: 9 of 11
31. (walk driver3 s1 p3-1)
   deleted: (at driver3 s1)
   added: (at driver3 p3-1)
   goals met: 9 of 11
32. (walk driver3 p3-1 s3)
   deleted: (at driver3 p3-1)
   added: (at driver3 s3)
   goals met: 10 of 11
33. (walk driver1 s4 p4-5)
   deleted: (at driver1 s4)
   added: (at driver1 p4-5)
   goals met: 10 of 11
34. (unload-truck package7 truck2 s1)
   deleted: (in package7 truck2)
   added: (at package7 s1)
   changed: (load truck2) from 1 to 0, (fuel-per-minute truck2) from 11 to 10
   goals met: 10 of 11
35. (walk driver1 p4-5 s5)
   deleted: (at driver1 p4-5)
   added: (at driver1 s5)
   goals met: 10 of 11
36. (board-truck driver1 truck1 s5)
   deleted: (at driver1 s5) (empty truck1)
   added: (driving driver1 truck1)
   goals met: 10 of 11
37. (drive-truck truck1 s5 s1 driver1)
   deleted: (at truck1 s5)
   added: (at truck1 s1)
   changed: (fuel-used) from 3255 to 3705
   goals met: 9 of 11
38. (load-truck package7 truck1 s1)
   deleted: (at package7 s1)
   added: (in package7 truck1)
   changed: (load truck1) from 0 to 1, (fuel-per-minute truck1) from 10 to 11
   goals met: 9 of 11
39. (drive-truck truck1 s1 s5 driver1)
   deleted: (at truck1 s1)
   added: (at truck1 s5)
   changed: (fuel-used) from 3705 to 4200
   goals met: 10 of 11
40. (drive-truck truck1 s5 s3 driver1)
   deleted: (at truck1 s5)
   added: (at truck1 s3)
   changed: (fuel-used) from 4200 to 4420
   goals met: 9 of 11
41. (unload-truck package7 truck1 s3)
   deleted: (in package7 truck1)
   added: (at package7 s3)
   changed: (load truck1) from 1 to 0, (fuel-per-minute truck1) from 11 to 10
   goals met: 10 of 11
42. (drive-truck truck1 s3 s5 driver1)
   deleted: (at truck1 s3)
   added: (at truck1 s5)
   changed: (fuel-used) from 4420 to 4620
   goals met: 11 of 11
